tap "brewforge/chinese"
tap "brewforge/extras"
tap "buo/cask-upgrade"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/core"
tap "homebrew/services"
tap "macos-fuse-t/cask"
tap "romkatv/powerlevel10k"
brew "btop"
brew "ca-certificates"
brew "openssl@3"
brew "sqlite"
brew "gh"
brew "go"
brew "goreleaser"
brew "libtool"
brew "graphviz"
brew "lima"
brew "mas"
brew "mkcert"
brew "node"
brew "pandoc"
brew "pillow", link: false
brew "postgresql@16"
brew "powerlevel10k"
brew "python-requests", link: false
brew "python-tk@3.12"
brew "python@3.11"
brew "shc"
brew "tailscale", restart_service: true
brew "thefuck"
brew "trash"
brew "tree"
brew "wget"
brew "yarn"
brew "brewforge/chinese/makemf"
brew "brewforge/chinese/nezha-agent"
cask "adguard"
cask "adrive"
cask "aldente"
cask "alist-desktop"
cask "amazon-q"
cask "anaconda"
cask "anythingllm"
cask "apifox"
cask "arc"
cask "baidunetdisk"
cask "barss"
cask "bartender"
cask "brewservicesmenubar"
cask "chatgpt"
cask "cheatsheet"
cask "cirrus"
cask "clash-verge-rev"
cask "cloud189"
cask "crossover"
cask "cryptomator"
cask "daisydisk"
cask "datweatherdoe"
cask "dbeaver-enterprise"
cask "debookee"
cask "discord"
cask "downie"
cask "drawio"
cask "e-study"
cask "easy-to-tv"
cask "finalshell"
cask "font-monaspace"
cask "font-profont-nerd-font"
cask "freefilesync"
cask "fuse-t"
cask "google-drive"
cask "gopeed"
cask "gpg-suite"
cask "gridea"
cask "hapigo"
cask "hbuilderx"
cask "i4tools"
cask "iconchanger"
cask "inkscape-cn"
cask "input-source-pro"
cask "iptvnator"
cask "itsycal"
cask "kdocs"
cask "languagetool"
cask "lingquan"
cask "lulu"
cask "lyricsxjh"
cask "macast"
cask "macfuse"
cask "macupdater"
cask "mastergo"
cask "menubarx"
cask "messauto"
cask "microsoft-auto-update"
cask "mos"
cask "mounty"
cask "neat"
cask "notchdrop"
cask "nutstore"
cask "obs"
cask "obsidian"
cask "opencat"
cask "orbstack"
cask "pareto-security"
cask "peekai"
cask "pgadmin4"
cask "piclist"
cask "pictogram"
cask "pixel-perfect"
cask "playcover-community"
cask "poe"
cask "popclip"
cask "popmaker"
cask "qbittorrent"
cask "qlmarkdown"
cask "qlvideo"
cask "qspace-pro"
cask "quarkclouddrive"
cask "rustdesk"
cask "ryujinx"
cask "screen-studio"
cask "sharemouse"
cask "shortcutdetective"
cask "sloth"
cask "sourcetree"
cask "stats"
cask "steam"
cask "swish"
cask "switchhosts"
cask "syntax-highlight"
cask "tencent-lemon"
cask "thunder"
cask "timemator"
cask "tmexclude"
cask "tor-browser"
cask "tts-vue"
cask "typora"
cask "ugreennas"
cask "uninstallpkg"
cask "upscayl"
cask "uu-booster"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "xnapper"
cask "yank-note"
cask "zerotier-one"
cask "zotero"
mas "AllMyBatteries", id: 1621263412
mas "Bitwarden", id: 1352778147
mas "Bob", id: 1630034110
mas "Camera Preview", id: 1632827132
mas "Canva", id: 897446215
mas "Cheetah", id: 1612199418
mas "Command X", id: 6448461551
mas "Dark Night", id: 1592844577
mas "Dark Reader for Safari", id: 1438243180
mas "DockX", id: 6452276577
mas "Dropover", id: 1355679052
mas "Encrypto", id: 935235287
mas "FastZip", id: 1565629813
mas "Folder Hub", id: 6473019059
mas "GeoGebra Calculator Suite", id: 1504416652
mas "Gifski", id: 1351639930
mas "He3", id: 6444177017
mas "HEIC Converter", id: 1294126402
mas "iCircuit", id: 454347770
mas "iCopy", id: 1638023723
mas "Image2icon", id: 992115977
mas "Immersive Translate", id: 6447957425
mas "iShot Pro", id: 1611347086
mas "Keynote 讲演", id: 409183694
mas "LocalSend", id: 1661733229
mas "Lockera Widgets", id: 6466819847
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "NeoServer", id: 6448362669
mas "Note Calculator", id: 779230763
mas "Numbers 表格", id: 409203825
mas "OmniPlayer", id: 1470926410
mas "One Markdown", id: 1507139439
mas "OneDrive", id: 823766827
mas "Orbot", id: 1609461599
mas "Pages 文稿", id: 409201541
mas "Pandan", id: 1569600264
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "QQ", id: 451108668
mas "Server Box", id: 1586449703
mas "sing-box", id: 6451272673
mas "SubRee", id: 1185763316
mas "Tampermonkey", id: 1482490089
mas "Telegram", id: 747648890
mas "TeraBox", id: 1509453185
mas "Twitter", id: 1482454543
mas "VidHub", id: 1659622164
mas "WebDAVNav Server", id: 747482894
mas "WeTab 新标签页", id: 6444470807
mas "WingsX", id: 6446119727
mas "WPS Office", id: 1443749478
mas "Zipic Lite", id: 6462364606
mas "即刻转换", id: 1637557903
mas "寻隐", id: 1664361663
mas "库乐队", id: 682658836
mas "微信", id: 836500024
mas "自动切换输入法", id: 1470350547
mas "超级桌面助手", id: 6446893480
mas "钱条", id: 1614349717
mas "飞书", id: 1551632588
vscode "10nates.ollama-autocoder"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alibaba-cloud.tongyi-lingma"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "aminer.codegeex"
vscode "anikghosh.ollama-copilot"
vscode "codeium.codeium"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "dakara.transformer"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "geezmolycos.vscode-hanzi-counter"
vscode "george-alisson.html-preview-vscode"
vscode "gera2ld.markmap-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "golang.go-nightly"
vscode "halo-dev.halo"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jeffersonlicet.snipped"
vscode "kuingsmile.vs-piclist"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mgt19937.typst-preview"
vscode "mhutchie.git-graph"
vscode "mkxml.vscode-filesize"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "myriad-dreamin.tinymist"
vscode "nvarner.typst-lsp"
vscode "oderwat.indent-rainbow"
vscode "orangex4.better-markdown-latex-shortcuts"
vscode "orangex4.hsnips"
vscode "orangex4.latex-sympy-calculator"
vscode "plibither8.remove-comments"
vscode "prateekmahendrakar.prettyxml"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "takumii.markdowntable"
vscode "vadimcn.vscode-lldb"
vscode "valentjn.vscode-ltex"
vscode "vscode-icons-team.vscode-icons"
vscode "wdhongtw.gpg-indicator"
vscode "yzhang.markdown-all-in-one"
